{
    bookId: 8463,
    bookTitle: "Guide to Construction",
    showTableOfContents: true,
    bookSections: [
        {
            header: "How to build in your house",
            text: "In order to build you will need to turn building mode on. This can be done on entering the house or using a button on the options interface. If you have a bank PIN you must enter it when entering building mode.\n\nIn building mode the ghostly shapes of furniture and doorways you have not built yet will appear in your house. These are called hotspots. You can use these to build furniture and new rooms.\n\nTo build a piece of furniture, right-click the hotspot and select Build. You will then be able to select the piece of furniture you want to build from the menu. Below each furniture icon is a list of materials; to build the furniture you will need to have all these materials in your intentory. You will also need to have a hammer, a saw and have the correct Construction level.\n\nNails work slightly differently to other materials. You will sometimes find you break nails, especially if you have a low Construction level, so you may need to bring more nails than the furniture requires. Nails made of stronger metals will break less often.\n\nYou can remove a piece of furniture if you wish to build something else in the same space. To do this, right-click on it and select Remove. You will not get any of the materials back. Some pieces of furniture can be upgraded to better pieces of furniture without having to remove them first.\n\nTo build a new room, you must use one of the door hotspots at the edges of rooms or garden squares. Right-click on it and select Build. This will bring up a list of rooms. Different rooms cost different amounts of gold and have different Construction level requirements.\n\nIf you select Build on a door hotspot that already leads to a room, you will be asked whether you want to delete that room."
        },
        {
            header: "Raw Materials",
            text: "The main raw material you will use to make furniture is planks. The sawmill operator north east of Varrock will turn logs into planks for you, for a fee. The useful planks are wood, oak, teak and mahogany. The sawmill operator also sells saws, cloth and nails.\n\nFor higher level furniture you may also need limestone, marble, gold leaf and magic building crystals. These are sold by the stonemason who lives in Keldagrim.\n\nSome pieces of furniture also require materials that are not specific to construction, such as steel bars and soft clay.",
        },
        {
            header: "Room types",
            text: "Parlour: This is the lowest-level room and provides space for three people to sit around a fire\nGarden: The garden is largely decorative but it also contains the exit portal.\nKitchen: This room can be used for preparing food. As you build better furniture in it you will find yourself able to prepare better meals in it.\nDining room: Eight people can sit around the tables you build in this room.\nBedroom: Some of the furniture in this room can be used to change your hair and clothes. You will also need to have two of these rooms in order to hire a servant.\nHalls: These are primarily used to connect other rooms, but they also provide space to show off the owner's skill and quest achievements.\nGames room: Various games can be built in this room to allow friends to play and train together.\nCombat Room: With this room you can challenge your friends in a personal duelling ring.\nWorkshop: This room allows you to train Construction without modifying your own house, by making furniture that can be sold to other players. It also provides space for you to train Crafting and Smithing.\nChapel: This room can be dedicated to any of RuneScape's major gods, and the altar can be used to offer bones.\nMenagerie: You can keep your pets in this room.\nStudy: You can use the lectern in this room to create clay tablets recording magic spells. Eagle lecterns make teleport spells and demon lecterns make enchantment spells. The elemental sphere in this room can be used to change the element of an elemental staff.\nPortal chamber: In this room you can build portals to various places around the world.\nFormal garden: The formal garden can contain various plants and ornaments to beautify the grounds of your house.\nThrone Room: This room can be used to hold audiences with large numbers of friends. It also contains the lever that turns on challenge mode.\nOubliette: If you build an oubliette below your throne room you can drop people from there into a cage which you can fill with various horrors.\nDungeon: Dungeon corridors and junctions can be built to create an underground maze full of monsters, traps and doors.\nTreasure room: You can place a prize in this room for visitors to your dungeon to try to reach."
        },
        {
            header: "Servants",
            text: "Once you have two bedrooms, you can hire a servant by going to the Servants' Guild in Ardougne. You will have to pay when you hire them, and the servant will then periodically demand wages. Servants can take items to and from the bank for you, and can also greet guests and serve food and drinks."
        }
    ]
}
